In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
ser1 = Series([0,1,2],index=['A', 'B', 'C'])
ser2 = Series([3,4,5,6],index=['A', 'B', 'C', 'D'])

In [3]:
# Add series
ser1+ser2

A     3
B     5
C     7
D   NaN
dtype: float64

In [5]:
# attemps with DF
df1 = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'), index=['NY', 'LA'])
df1

    A  B
NY  0  1
LA  2  3

In [7]:
df2 = DataFrame(np.arange(9).reshape((3,3)), columns=list('ADC'), index=['NY', 'SF', 'LA'])
df2

    A  D  C
NY  0  1  2
SF  3  4  5
LA  6  7  8

In [8]:
# successfully add when matching, drop everything else
df1 + df2

     A   B   C   D
LA   8 NaN NaN NaN
NY   0 NaN NaN NaN
SF NaN NaN NaN NaN

In [9]:
# fills everthing to 0 then adds
df1.add(df2, fill_value=0)

    A   B  C  D
LA  8   3  8  7
NY  0   1  2  1
SF  3 NaN  5  4

In [10]:
# operations between series and dataframes
ser3 = df2.ix[0]
ser3

A    0
D    1
C    2
Name: NY, dtype: int64

In [11]:
# works perfectly where it matches up
df2 - ser3

    A  D  C
NY  0  0  0
SF  3  3  3
LA  6  6  6